app/controllers/account_controller.rb

  def signup
    @user = User.new(params[:user])
    return unless request.post?
    @user.save!
---
INSERT INTO "users" ("salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('ad67a96f1671dae3984bb740d557e4c50b759a38', '2009-12-07 08:48:27', 'b3c03cb6c20f1ba9c39388bf6e9863020f9dd72a', NULL, NULL, 'nakatuyo', 'nakatuyo@gmail.com', '2009-12-07 08:48:27')