app/controllers/items_controller.rb

SELECT * FROM "items"
---
  def index
    @items = Item.all

SELECT * FROM "items" WHERE ("items"."id" = 1)
---
  def show
    @item = Item.find(params[:id])

INSERT INTO "items" ("name", "updated_at", "value", "created_at") VALUES('公開', '2009-11-19 04:22:24', 1, '2009-11-19 04:22:24')
---
  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save