app/controllers/positions_controller.rb

  def index
    @positions = Position.all
---
SELECT * FROM "positions"

  def show
    @position = Position.find(params[:id])
---
SELECT * FROM "positions" WHERE ("positions"."id" = 1)

  def edit
    @position = Position.find(params[:id])
---
SELECT * FROM "positions" WHERE ("positions"."id" = 1)

  def create
    @position = Position.new(params[:position])

    respond_to do |format|
      if @position.save
---
INSERT INTO "positions" ("name", "updated_at", "value", "created_at") VALUES('受付中', '2009-11-19 04:26:20', 0, '2009-11-19 04:26:20')

  def update
    @position = Position.find(params[:id])

    respond_to do |format|
      if @position.update_attributes(params[:position])
---
SELECT * FROM "positions" WHERE ("positions"."id" = 1)
UPDATE "positions" SET "name" = '受付しただけ', "updated_at" = '2009-11-19 04:26:59' WHERE "id" = 1