app/controllers/results_controller.rb

SELECT * FROM "results"
---
  def index
    @results = Result.all

SELECT * FROM "results" WHERE ("results"."id" = 1)
---
  def show
    @result = Result.find(params[:id])

INSERT INTO "results" ("updated_at", "issue_id", "responder", "reserach", "created_at") VALUES('2009-11-18 04:17:11', 1, 'lklkj', 'lkjlkj', '2009-11-18 04:17:11')
---
  def create
    @result = Result.new(params[:result])

    respond_to do |format|
      if @result.save

SELECT * FROM "results" WHERE ("results"."id" = 1)
DELETE FROM "results" WHERE "id" = 1
---
  def destroy
    @result = Result.find(params[:id])
    @result.destroy