app/controllers/top_controller.rb

  def index
    @issue = Issue.all
    @issue_cnt = Issue.count
---
SELECT * FROM "issues"
SELECT count(*) AS count_all FROM "issues"

  def create
    @issue_new=Issue.new(params[:inp])
    @issue_new.save
---
INSERT INTO "issues" ("status", "updated_at", "title", "querist", "content", "mail_addr", "ope_public", "due", "created_at") VALUES(1, '2009-11-18 02:21:41', 'lkj', 'lkjlkj', 'lkjlkj', 'lkjlkj', 1, '2009-12-31', '2009-11-18 02:21:41')

  def edit
    @issue_edit= Issue.find(params[:id])
---
SELECT * FROM "issues" WHERE ("issues"."id" = 3)

  def create2
    @result=Result.new(params[:result])
    @result.save
---
INSERT INTO "results" ("updated_at", "issue_id", "responder", "reserach", "created_at") VALUES('2009-11-18 05:56:23', NULL, 'ｌｋｊ', 'ｌｋｌｋｊ', '2009-11-18 05:56:23')

  def destroy
    @issue = Issue.find(params[:id])
    @issue.destroy
---
SELECT * FROM "issues" WHERE ("issues"."id" = 1)
DELETE FROM "issues" WHERE "id" = 1